Repository: JamieBartleet/CTecUtil
Catalog: Cultures/Resources.*.resx
Languages: ga_ie

# Error_Checksum_Fail
source: Invalid data was received from the panel.
ga_ie: Fuarthas sonraí neamhbhailí ón bpainéal.

# Error_Download_Retries
source: Download cancelled after too many retries.
ga_ie: Cuireadh Teh Download ar ceal tar éis an iomarca retries.

# Error_Download_Timeout
source: Download failed because the panel did not respond within the time limit.
ga_ie: Theip ar an Íoslódáil toisc nár fhreagair an painéal laistigh den teorainn ama.

# Error_Downloading_Data
source: An error occurred while receiving data from the panel.
ga_ie: Tharla earráid agus sonraí á bhfáil ón bpainéal.

# Error_Serial_Port
source: Error opening the serial port.
ga_ie: Earráid ag oscailt an chalafoirt shrathaigh.

# Error_Upload_Retries
source: Upload cancelled after too many retries.
ga_ie: Cuireadh an t-uaslódáil ar ceal tar éis an iomarca aisdúichithe.

# Error_Upload_Timeout
source: Upload failed because the panel did not respond within the time limit.
ga_ie: Theip ar an uaslódáil toisc nár fhreagair an painéal laistigh den teorainn ama.

# Option_Cancel
source: Cancel
ga_ie: Cealaigh

# Error_Uploading_Data
source: An error occurred while sending data to the panel.
ga_ie: Tharla earráid agus sonraí á seoladh chuig an bpainéal.

# Comms_Connected_Writeable
source: Connected - data may be written
ga_ie: Ceangailte - is féidir sonraí a scríobh

# Comms_Disconnected
source: Disconnected
ga_ie: Dícheangailte

# Comms_Listening
source: Listening for logging data
ga_ie: Éisteacht le haghaidh sonraí logála

# Comms_Connected_ReadOnly
source: Connected - data is read-only
ga_ie: Ceangailte - léitear sonraí amháin
